<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"53a6b52f7edaa6b67594ec667637680d01c232c0ce86ea6ae6630f259bed27dd","plan_job_ref":"Job Terraform Plan #6 at https://github.com/Ileriayo/terraform-github-actions-aws/actions/runs/10345563246","plan_out_hash":"af54119f232e6797ea59231c67e80f374c033ffc654cb9a0b66127a66ec94db2","plan_hash":"c23e0c8cd2565b275ba918b66d086f2f6782bd1ad03fb6a2c9997b91551621c7","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __./__
With backend config files: `backend.tfvars.ghactions`<details open><summary>With variables</summary>

```hcl
bucket_name     = "ghactions-test-f6bb4d23e122165b9f14ff3fa6817a6e8167c350"
repository_name = "ghactions-test-f6bb4d23e122165b9f14ff3fa6817a6e8167c350"
```
</details>
<details>
<summary>Plan: 6 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.bucket.aws_s3_access_point.access_point will be created
+   resource "aws_s3_access_point" "access_point" {
+       account_id               = (known after apply)
+       alias                    = (known after apply)
+       arn                      = (known after apply)
+       bucket                   = (known after apply)
+       bucket_account_id        = (known after apply)
+       domain_name              = (known after apply)
+       endpoints                = (known after apply)
+       has_public_access_policy = (known after apply)
+       id                       = (known after apply)
+       name                     = "ileriaccesspoint"
+       network_origin           = (known after apply)
+       policy                   = (known after apply)

+       vpc_configuration {
+           vpc_id = "*********************"
        }
    }

  # module.bucket.aws_s3_bucket.bucket will be created
+   resource "aws_s3_bucket" "bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "ghactions-test-f6bb4d23e122165b9f14ff3fa6817a6e8167c350"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Environment" = "Dev"
+           "Name"        = "DevOps"
        }
+       tags_all                    = {
+           "Environment" = "Dev"
+           "Name"        = "DevOps"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.bucket.aws_s3_bucket_ownership_controls.ownership_controls will be created
+   resource "aws_s3_bucket_ownership_controls" "ownership_controls" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           object_ownership = "BucketOwnerEnforced"
        }
    }

  # module.bucket.aws_s3_bucket_public_access_block.public_access will be created
+   resource "aws_s3_bucket_public_access_block" "public_access" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # module.bucket.aws_s3_bucket_server_side_encryption_configuration.bucket_encryption will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "bucket_encryption" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           apply_server_side_encryption_by_default {
+               sse_algorithm     = "aws:kms"
#                (1 unchanged attribute hidden)
            }
        }
    }

  # module.ecr.aws_ecr_repository.repository will be created
+   resource "aws_ecr_repository" "repository" {
+       arn                  = (known after apply)
+       force_delete         = true
+       id                   = (known after apply)
+       image_tag_mutability = "IMMUTABLE"
+       name                 = "ghactions-test-f6bb4d23e122165b9f14ff3fa6817a6e8167c350"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags                 = {
+           "Environment" = "Dev"
+           "Name"        = "DevOps"
        }
+       tags_all             = {
+           "Environment" = "Dev"
+           "Name"        = "DevOps"
        }

+       encryption_configuration {
+           encryption_type = "KMS"
+           kms_key         = (known after apply)
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #6](https://github.com/Ileriayo/terraform-github-actions-aws/actions/runs/10345563246)